/**
 * Unicode case test data.
 * 
 */
#include "test-data.h"

/**
 * All lower case characters as in a single string.
 */
const wchar_t* allLowerCaseCharacters =
    // Basic Latin
    L"abcdefghijklmnopqrstuvwxyz"

    // Latin 1 Supplement
    L"ßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýþÿ"

    // Latin Extended A
    L"āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįıĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷźżž"

    // Latin Extended B
    L"ƃƅƈƌƒƙơƣƥƨƭưƴƶƹƽǆǉǌǎǐǒǔǖǘǚǜǟǡǣǥǧǩǫǭǯǳǵǹǻǽǿȁȃȅȇȉȋȍȏȑȓȕȗșțȝȟȣȥȧȩȫȭȯȱȳȼɂɇɉɋɍɏ";

/**
 * All upper case characters as in a single string.
 */
const wchar_t* allUpperCaseCharacters =
    // Basic Latin
    L"ABCDEFGHIJKLMNOPQRSTUVWXYZ"

    // Latin 1 Supplement
    L"ẞÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞŸ"

    // Latin Extended A
    L"ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŹŻŽ"

    // Latin Extended B
    L"ƂƄƇƋƑƘƠƢƤƧƬƯƳƵƸƼǄǇǊǍǏǑǓǕǗǙǛǞǠǢǤǦǨǪǬǮǱǴǸǺǼǾȀȂȄȆȈȊȌȎȐȒȔȖȘȚȜȞȢȤȦȨȪȬȮȰȲȻɁɆɈɊɌɎ";

/**
 * Array of upper and lower case pairs.
 */
struct upperLowerCasePair upperLowerCasePairList[] = {
    // Basic Latin
    { L'a', 0x0061, L'A', 0x0041 },
    { L'b', 0x0062, L'B', 0x0042 },
    { L'c', 0x0063, L'C', 0x0043 },
    { L'd', 0x0064, L'D', 0x0044 },
    { L'e', 0x0065, L'E', 0x0045 },
    { L'f', 0x0066, L'F', 0x0046 },
    { L'g', 0x0067, L'G', 0x0047 },
    { L'h', 0x0068, L'H', 0x0048 },
    { L'i', 0x0069, L'I', 0x0049 },
    { L'j', 0x006A, L'J', 0x004A },
    { L'k', 0x006B, L'K', 0x004B },
    { L'l', 0x006C, L'L', 0x004C },
    { L'm', 0x006D, L'M', 0x004D },
    { L'n', 0x006E, L'N', 0x004E },
    { L'o', 0x006F, L'O', 0x004F },
    { L'p', 0x0070, L'P', 0x0050 },
    { L'q', 0x0071, L'Q', 0x0051 },
    { L'r', 0x0072, L'R', 0x0052 },
    { L's', 0x0073, L'S', 0x0053 },
    { L't', 0x0074, L'T', 0x0054 },
    { L'u', 0x0075, L'U', 0x0055 },
    { L'v', 0x0076, L'V', 0x0056 },
    { L'w', 0x0077, L'W', 0x0057 },
    { L'x', 0x0078, L'X', 0x0058 },
    { L'y', 0x0079, L'Y', 0x0059 },
    { L'z', 0x007A, L'Z', 0x005A },

    // Latin 1 Supplement
    { L'ß', 0x00DF, L'ẞ', 0x1E9E },
    { L'à', 0x00E0, L'À', 0x00C0 },
    { L'á', 0x00E1, L'Á', 0x00C1 },
    { L'â', 0x00E2, L'Â', 0x00C2 },
    { L'ã', 0x00E3, L'Ã', 0x00C3 },
    { L'ä', 0x00E4, L'Ä', 0x00C4 },
    { L'å', 0x00E5, L'Å', 0x00C5 },
    { L'æ', 0x00E6, L'Æ', 0x00C6 },
    { L'ç', 0x00E7, L'Ç', 0x00C7 },
    { L'è', 0x00E8, L'È', 0x00C8 },
    { L'é', 0x00E9, L'É', 0x00C9 },
    { L'ê', 0x00EA, L'Ê', 0x00CA },
    { L'ë', 0x00EB, L'Ë', 0x00CB },
    { L'ì', 0x00EC, L'Ì', 0x00CC },
    { L'í', 0x00ED, L'Í', 0x00CD },
    { L'î', 0x00EE, L'Î', 0x00CE },
    { L'ï', 0x00EF, L'Ï', 0x00CF },
    { L'ð', 0x00F0, L'Ð', 0x00D0 },
    { L'ñ', 0x00F1, L'Ñ', 0x00D1 },
    { L'ò', 0x00F2, L'Ò', 0x00D2 },
    { L'ó', 0x00F3, L'Ó', 0x00D3 },
    { L'ô', 0x00F4, L'Ô', 0x00D4 },
    { L'õ', 0x00F5, L'Õ', 0x00D5 },
    { L'ö', 0x00F6, L'Ö', 0x00D6 },
    { L'ø', 0x00F8, L'Ø', 0x00D8 },
    { L'ù', 0x00F9, L'Ù', 0x00D9 },
    { L'ú', 0x00FA, L'Ú', 0x00DA },
    { L'û', 0x00FB, L'Û', 0x00DB },
    { L'ü', 0x00FC, L'Ü', 0x00DC },
    { L'ý', 0x00FD, L'Ý', 0x00DD },
    { L'þ', 0x00FE, L'Þ', 0x00DE },
    { L'ÿ', 0x00FF, L'Ÿ', 0x0178 },

    // Latin Extended A
    { L'ā', 0x0101, L'Ā', 0x0100 },
    { L'ă', 0x0103, L'Ă', 0x0102 },
    { L'ą', 0x0105, L'Ą', 0x0104 },
    { L'ć', 0x0107, L'Ć', 0x0106 },
    { L'ĉ', 0x0109, L'Ĉ', 0x0108 },
    { L'ċ', 0x010B, L'Ċ', 0x010A },
    { L'č', 0x010D, L'Č', 0x010C },
    { L'ď', 0x010F, L'Ď', 0x010E },
    { L'đ', 0x0111, L'Đ', 0x0110 },
    { L'ē', 0x0113, L'Ē', 0x0112 },
    { L'ĕ', 0x0115, L'Ĕ', 0x0114 },
    { L'ė', 0x0117, L'Ė', 0x0116 },
    { L'ę', 0x0119, L'Ę', 0x0118 },
    { L'ě', 0x011B, L'Ě', 0x011A },
    { L'ĝ', 0x011D, L'Ĝ', 0x011C },
    { L'ğ', 0x011F, L'Ğ', 0x011E },
    { L'ġ', 0x0121, L'Ġ', 0x0120 },
    { L'ģ', 0x0123, L'Ģ', 0x0122 },
    { L'ĥ', 0x0125, L'Ĥ', 0x0124 },
    { L'ħ', 0x0127, L'Ħ', 0x0126 },
    { L'ĩ', 0x0129, L'Ĩ', 0x0128 },
    { L'ī', 0x012B, L'Ī', 0x012A },
    { L'ĭ', 0x012D, L'Ĭ', 0x012C },
    { L'į', 0x012F, L'Į', 0x012E },
    { L'ı', 0x0131, L'İ', 0x0130 },
    { L'ĳ', 0x0133, L'Ĳ', 0x0132 },
    { L'ĵ', 0x0135, L'Ĵ', 0x0134 },
    { L'ķ', 0x0137, L'Ķ', 0x0136 },
    { L'ĺ', 0x013A, L'Ĺ', 0x0139 },
    { L'ļ', 0x013C, L'Ļ', 0x013B },
    { L'ľ', 0x013E, L'Ľ', 0x013D },
    { L'ŀ', 0x0140, L'Ŀ', 0x013F },
    { L'ł', 0x0142, L'Ł', 0x0141 },
    { L'ń', 0x0144, L'Ń', 0x0143 },
    { L'ņ', 0x0146, L'Ņ', 0x0145 },
    { L'ň', 0x0148, L'Ň', 0x0147 },
    { L'ŋ', 0x014B, L'Ŋ', 0x014A },
    { L'ō', 0x014D, L'Ō', 0x014C },
    { L'ŏ', 0x014F, L'Ŏ', 0x014E },
    { L'ő', 0x0151, L'Ő', 0x0150 },
    { L'œ', 0x0153, L'Œ', 0x0152 },
    { L'ŕ', 0x0155, L'Ŕ', 0x0154 },
    { L'ŗ', 0x0157, L'Ŗ', 0x0156 },
    { L'ř', 0x0159, L'Ř', 0x0158 },
    { L'ś', 0x015B, L'Ś', 0x015A },
    { L'ŝ', 0x015D, L'Ŝ', 0x015C },
    { L'ş', 0x015F, L'Ş', 0x015E },
    { L'š', 0x0161, L'Š', 0x0160 },
    { L'ţ', 0x0163, L'Ţ', 0x0162 },
    { L'ť', 0x0165, L'Ť', 0x0164 },
    { L'ŧ', 0x0167, L'Ŧ', 0x0166 },
    { L'ũ', 0x0169, L'Ũ', 0x0168 },
    { L'ū', 0x016B, L'Ū', 0x016A },
    { L'ŭ', 0x016D, L'Ŭ', 0x016C },
    { L'ů', 0x016F, L'Ů', 0x016E },
    { L'ű', 0x0171, L'Ű', 0x0170 },
    { L'ų', 0x0173, L'Ų', 0x0172 },
    { L'ŵ', 0x0175, L'Ŵ', 0x0174 },
    { L'ŷ', 0x0177, L'Ŷ', 0x0176 },
    { L'ź', 0x017A, L'Ź', 0x0179 },
    { L'ż', 0x017C, L'Ż', 0x017B },
    { L'ž', 0x017E, L'Ž', 0x017D },

    // Latin Extended B
    { L'ƃ', 0x0183, L'Ƃ', 0x0182 },
    { L'ƅ', 0x0185, L'Ƅ', 0x0184 },
    { L'ƈ', 0x0188, L'Ƈ', 0x0187 },
    { L'ƌ', 0x018C, L'Ƌ', 0x018B },
    { L'ƒ', 0x0192, L'Ƒ', 0x0191 },
    { L'ƙ', 0x0199, L'Ƙ', 0x0198 },
    { L'ơ', 0x01A1, L'Ơ', 0x01A0 },
    { L'ƣ', 0x01A3, L'Ƣ', 0x01A2 },
    { L'ƥ', 0x01A5, L'Ƥ', 0x01A4 },
    { L'ƨ', 0x01A8, L'Ƨ', 0x01A7 },
    { L'ƭ', 0x01AD, L'Ƭ', 0x01AC },
    { L'ư', 0x01B0, L'Ư', 0x01AF },
    { L'ƴ', 0x01B4, L'Ƴ', 0x01B3 },
    { L'ƶ', 0x01B6, L'Ƶ', 0x01B5 },
    { L'ƹ', 0x01B9, L'Ƹ', 0x01B8 },
    { L'ƽ', 0x01BD, L'Ƽ', 0x01BC },
    { L'ǆ', 0x01C6, L'Ǆ', 0x01C4 },
    { L'ǉ', 0x01C9, L'Ǉ', 0x01C7 },
    { L'ǌ', 0x01CC, L'Ǌ', 0x01CA },
    { L'ǎ', 0x01CE, L'Ǎ', 0x01CD },
    { L'ǐ', 0x01D0, L'Ǐ', 0x01CF },
    { L'ǒ', 0x01D2, L'Ǒ', 0x01D1 },
    { L'ǔ', 0x01D4, L'Ǔ', 0x01D3 },
    { L'ǖ', 0x01D6, L'Ǖ', 0x01D5 },
    { L'ǘ', 0x01D8, L'Ǘ', 0x01D7 },
    { L'ǚ', 0x01DA, L'Ǚ', 0x01D9 },
    { L'ǜ', 0x01DC, L'Ǜ', 0x01DB },
    { L'ǟ', 0x01DF, L'Ǟ', 0x01DE },
    { L'ǡ', 0x01E1, L'Ǡ', 0x01E0 },
    { L'ǣ', 0x01E3, L'Ǣ', 0x01E2 },
    { L'ǥ', 0x01E5, L'Ǥ', 0x01E4 },
    { L'ǧ', 0x01E7, L'Ǧ', 0x01E6 },
    { L'ǩ', 0x01E9, L'Ǩ', 0x01E8 },
    { L'ǫ', 0x01EB, L'Ǫ', 0x01EA },
    { L'ǭ', 0x01ED, L'Ǭ', 0x01EC },
    { L'ǯ', 0x01EF, L'Ǯ', 0x01EE },
    { L'ǳ', 0x01F3, L'Ǳ', 0x01F1 },
    { L'ǵ', 0x01F5, L'Ǵ', 0x01F4 },
    { L'ǹ', 0x01F9, L'Ǹ', 0x01F8 },
    { L'ǻ', 0x01FB, L'Ǻ', 0x01FA },
    { L'ǽ', 0x01FD, L'Ǽ', 0x01FC },
    { L'ǿ', 0x01FF, L'Ǿ', 0x01FE },
    { L'ȁ', 0x0201, L'Ȁ', 0x0200 },
    { L'ȃ', 0x0203, L'Ȃ', 0x0202 },
    { L'ȅ', 0x0205, L'Ȅ', 0x0204 },
    { L'ȇ', 0x0207, L'Ȇ', 0x0206 },
    { L'ȉ', 0x0209, L'Ȉ', 0x0208 },
    { L'ȋ', 0x020B, L'Ȋ', 0x020A },
    { L'ȍ', 0x020D, L'Ȍ', 0x020C },
    { L'ȏ', 0x020F, L'Ȏ', 0x020E },
    { L'ȑ', 0x0211, L'Ȑ', 0x0210 },
    { L'ȓ', 0x0213, L'Ȓ', 0x0212 },
    { L'ȕ', 0x0215, L'Ȕ', 0x0214 },
    { L'ȗ', 0x0217, L'Ȗ', 0x0216 },
    { L'ș', 0x0219, L'Ș', 0x0218 },
    { L'ț', 0x021B, L'Ț', 0x021A },
    { L'ȝ', 0x021D, L'Ȝ', 0x021C },
    { L'ȟ', 0x021F, L'Ȟ', 0x021E },
    { L'ȣ', 0x0223, L'Ȣ', 0x0222 },
    { L'ȥ', 0x0225, L'Ȥ', 0x0224 },
    { L'ȧ', 0x0227, L'Ȧ', 0x0226 },
    { L'ȩ', 0x0229, L'Ȩ', 0x0228 },
    { L'ȫ', 0x022B, L'Ȫ', 0x022A },
    { L'ȭ', 0x022D, L'Ȭ', 0x022C },
    { L'ȯ', 0x022F, L'Ȯ', 0x022E },
    { L'ȱ', 0x0231, L'Ȱ', 0x0230 },
    { L'ȳ', 0x0233, L'Ȳ', 0x0232 },
    { L'ȼ', 0x023C, L'Ȼ', 0x023B },
    { L'ɂ', 0x0242, L'Ɂ', 0x0241 },
    { L'ɇ', 0x0247, L'Ɇ', 0x0246 },
    { L'ɉ', 0x0249, L'Ɉ', 0x0248 },
    { L'ɋ', 0x024B, L'Ɋ', 0x024A },
    { L'ɍ', 0x024D, L'Ɍ', 0x024C },
    { L'ɏ', 0x024F, L'Ɏ', 0x024E },



};

/**
 * The number of upper lower case pairs in the list
 */
int upperLowerCasePairListCount = sizeof(upperLowerCasePairList) / sizeof(upperLowerCasePair);